##########################################
#
#		BREWTIFUL
#
##########################################

# `brew bundle` installs everything here.
# Some tools are commented out because I don't need them on every new install.

# databases
# brew 'redis'
# brew 'yarn'
# brew 'postgresql'
# brew 'pgcli'                      # Nicer postgres CLI
# brew 'mysql'

# core tools
brew 'git'
brew 'mise'                          # Polyglot version manager (Ruby, Node, etc). Replaces rbenv.
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
# brew 'awscli'

# modern unix (https://github.com/ibraheemdev/modern-unix)
brew 'bat'                           # Cat, but better. File viewer
brew 'diff-so-fancy'                 # Good-lookin' diffs
brew 'htop'                          # Top but colourfuller. Interactive process viewer.
brew 'tldr'                          # Terser man pages.
brew 'zoxide'                        # Smarter cd: learns your most-used dirs. Use `z` to jump, `zi` to fuzzy-pick.
brew 'eza'                           # Modern ls: colours, icons, git status column (replaces ls + tree)
brew 'ripgrep'                       # Superfast grep. Also used by fzf.
brew 'fzf'                           # General-purpose fuzzyfinder. Used in command-line and Vim.
brew 'fd'                            # Fast, user-friendly find alternative
brew 'glow'                          # Beautiful CLI markdown renderer: .md files look good on the command line!
brew 'ffmpeg'                        # Media processing (audio/video conversion, thumbnails, etc)
brew 'yt-dlp'                        # Download video/audio from YouTube and 500+ sites
brew 'imagemagick'                   # Image conversion and manipulation
brew 'starship'                      # Cross-shell prompt: git status, language versions, exit codes
brew 'lazygit'                       # Terminal UI for git: stage hunks, interactive rebase, branch management
brew 'gh'                            # GitHub CLI
brew 'cheat'                         # customisable cheatsheets for command-line tools

# editors & terminals
brew 'neovim'
brew 'tmux'                          # Terminal multiplexer: persistent sessions, split panes
brew 'zsh'
brew 'bash-completion'
brew 'tree-sitter'                   # Parses computer languages (used for better syntax highlighting etc by neovim)

# casks (graphical applications)
cask 'docker-desktop'
cask 'visual-studio-code'
cask 'cursor'
cask 'claude'
cask 'claude-code'
cask 'iterm2'
cask 'rectangle'                     # Window tiling manager (replaced Spectacle). Set to Cmd-opt-left/right/up/down to resize windows.
cask 'dash'
cask 'spotify'
cask 'obsidian'                      # Note-taking in markdown
# cask 'slack'
cask 'zoom'
cask 'lastpass'
cask 'telegram'
cask 'discord'
cask 'whatsapp'
cask 'selfcontrol'                   # Properly block addicting sites and apps
# cask 'anki'                        # Flashcards for remembering stuff
# cask 'notion'
cask 'meetingbar'                    # Displays the day's upcoming meetings in the Mac menubar
cask 'bluesnooze'                    # Sleeping mac = bluetooth off
# cask 'postman'                     # GUI for HTTP requests
# cask 'dbeaver-community'           # SQL database client

cask 'font-fira-code-nerd-font'      # Fira Code + Nerd Font icons (replaces font-fira-code)
cask 'font-fira-sans'
