# databases & deps
# brew 'elasticsearch'
brew 'redis'
brew 'imagemagick'
brew 'yarn'
brew 'postgresql'
brew 'awscli'

# asdf
# brew 'asdf'
brew 'rbenv'
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'

# editors & terminals
brew 'vim'
brew 'neovim'
brew 'zsh'
brew 'bash-completion'

# tools
brew 'fzf'
brew 'git'
brew 'pgcli'
brew 'z'
brew 'tree'
brew 'tldr'
brew 'htop'
brew 'diff-so-fancy'

# doom emacs and dependencies
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'
brew 'fd'
brew 'ripgrep'

# cask
tap 'homebrew/cask'
cask 'iterm2'
cask 'spectacle'
cask 'dash'
cask 'spotify'
cask 'slack'
cask 'zoom'
cask 'lastpass'
cask 'private-internet-access'
cask 'anki'
cask 'notion'
cask 'docker'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-sans'
