# Databases
brew 'redis'
brew 'imagemagick'
brew 'yarn'
brew 'postgresql'
brew 'pgcli' # Nicer postgres CLI
# brew 'mysql'

# Core tools
brew 'git'
brew 'rbenv' # Ruby version manager
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
brew 'awscli'
brew 'pgcli'


# Modern Unix (https://github.com/ibraheemdev/modern-unix)
brew 'bat' # Cat, but better. File viewer
brew 'diff-so-fancy' # Good-lookin' diffs
brew 'htop' # Top but colourfuller. Interactive process viewer.
brew 'tldr' # Terser man pages.
brew 'z' 	# Like `cd`, but way better. Teleport between disparate directories.
brew 'tree'
brew 'ripgrep' # Superfast grep. Also used by fzf.
brew 'fzf' # General-purpose fuzzyfinder. Used in command-line and Vim.

# Editors & terminals
brew 'vim'
brew 'neovim'
brew 'zsh'
brew 'bash-completion'

# Kubernetes & Docker
cask 'docker'
brew 'kubectx'
brew 'kubernetes-cli'

# doom emacs and dependencies
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'
brew 'fd' # Fast, user-friendly find alternative

# Helpful
brew 'bluesnooze' # Sleeping mac = bluetooth off

# Casks
tap 'homebrew/cask'
cask 'iterm2'
cask 'spectacle' # Window tiling manager
cask 'dash'
cask 'spotify'
cask 'slack'
cask 'zoom'
cask 'lastpass'
cask 'anki' # Flashcards for remembering stuff
cask 'notion'
cask 'nordvpn' # VPN
cask 'meetingbar' # Displays the day's upcoming meetings in the Mac menubar

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-sans'
